Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxPort_bf.h
/** \brief Mask for Ifx_P_PCSR_Bits.SEL0 */
#define IFX_P_PCSR_SEL0_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL0 */
#define IFX_P_PCSR_SEL0_OFF (0u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_OFF (1u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_OFF (2u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_OFF (3u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_OFF (4u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_OFF (5u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_OFF (6u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL7 */
#define IFX_P_PCSR_SEL7_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL7 */
#define IFX_P_PCSR_SEL7_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL7 */
#define IFX_P_PCSR_SEL7_OFF (7u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL8 */
#define IFX_P_PCSR_SEL8_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL8 */
#define IFX_P_PCSR_SEL8_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL8 */
#define IFX_P_PCSR_SEL8_OFF (8u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL9 */
#define IFX_P_PCSR_SEL9_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL9 */
#define IFX_P_PCSR_SEL9_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL9 */
#define IFX_P_PCSR_SEL9_OFF (9u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_OFF (10u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_OFF (11u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL12 */
#define IFX_P_PCSR_SEL12_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL12 */
#define IFX_P_PCSR_SEL12_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL12 */
#define IFX_P_PCSR_SEL12_OFF (12u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL13 */
#define IFX_P_PCSR_SEL13_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL13 */
#define IFX_P_PCSR_SEL13_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL13 */
#define IFX_P_PCSR_SEL13_OFF (13u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL14 */
#define IFX_P_PCSR_SEL14_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL14 */
#define IFX_P_PCSR_SEL14_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL14 */
#define IFX_P_PCSR_SEL14_OFF (14u)

/** \brief Length for Ifx_P_PCSR_Bits.SEL15 */
#define IFX_P_PCSR_SEL15_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.SEL15 */
#define IFX_P_PCSR_SEL15_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.SEL15 */
#define IFX_P_PCSR_SEL15_OFF (15u)

/** \brief Length for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_LEN (1u)

/** \brief Mask for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_MSK (0x1u)

/** \brief Offset for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_OFF (31u)

/** \brief Length for Ifx_P_OMSR0_Bits.PS0 */
#define IFX_P_OMSR0_PS0_LEN (1u)

/** \brief Mask for Ifx_P_OMSR0_Bits.PS0 */
#define IFX_P_OMSR0_PS0_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR0_Bits.PS0 */
#define IFX_P_OMSR0_PS0_OFF (0u)

/** \brief Length for Ifx_P_OMSR0_Bits.PS1 */
#define IFX_P_OMSR0_PS1_LEN (1u)

/** \brief Mask for Ifx_P_OMSR0_Bits.PS1 */
#define IFX_P_OMSR0_PS1_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR0_Bits.PS1 */
#define IFX_P_OMSR0_PS1_OFF (1u)

/** \brief Length for Ifx_P_OMSR0_Bits.PS2 */
#define IFX_P_OMSR0_PS2_LEN (1u)

/** \brief Mask for Ifx_P_OMSR0_Bits.PS2 */
#define IFX_P_OMSR0_PS2_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR0_Bits.PS2 */
#define IFX_P_OMSR0_PS2_OFF (2u)

/** \brief Length for Ifx_P_OMSR0_Bits.PS3 */
#define IFX_P_OMSR0_PS3_LEN (1u)

/** \brief Mask for Ifx_P_OMSR0_Bits.PS3 */
#define IFX_P_OMSR0_PS3_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR0_Bits.PS3 */
#define IFX_P_OMSR0_PS3_OFF (3u)

/** \brief Length for Ifx_P_OMSR4_Bits.PS4 */
#define IFX_P_OMSR4_PS4_LEN (1u)

/** \brief Mask for Ifx_P_OMSR4_Bits.PS4 */
#define IFX_P_OMSR4_PS4_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR4_Bits.PS4 */
#define IFX_P_OMSR4_PS4_OFF (4u)

/** \brief Length for Ifx_P_OMSR4_Bits.PS5 */
#define IFX_P_OMSR4_PS5_LEN (1u)

/** \brief Mask for Ifx_P_OMSR4_Bits.PS5 */
#define IFX_P_OMSR4_PS5_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR4_Bits.PS5 */
#define IFX_P_OMSR4_PS5_OFF (5u)

/** \brief Length for Ifx_P_OMSR4_Bits.PS6 */
#define IFX_P_OMSR4_PS6_LEN (1u)

/** \brief Mask for Ifx_P_OMSR4_Bits.PS6 */
#define IFX_P_OMSR4_PS6_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR4_Bits.PS6 */
#define IFX_P_OMSR4_PS6_OFF (6u)

/** \brief Length for Ifx_P_OMSR4_Bits.PS7 */
#define IFX_P_OMSR4_PS7_LEN (1u)

/** \brief Mask for Ifx_P_OMSR4_Bits.PS7 */
#define IFX_P_OMSR4_PS7_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR4_Bits.PS7 */
#define IFX_P_OMSR4_PS7_OFF (7u)

/** \brief Length for Ifx_P_OMSR8_Bits.PS8 */
#define IFX_P_OMSR8_PS8_LEN (1u)

/** \brief Mask for Ifx_P_OMSR8_Bits.PS8 */
#define IFX_P_OMSR8_PS8_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR8_Bits.PS8 */
#define IFX_P_OMSR8_PS8_OFF (8u)

/** \brief Length for Ifx_P_OMSR8_Bits.PS9 */
#define IFX_P_OMSR8_PS9_LEN (1u)

